DataFrame 확인하기

object 가 문자열 
시리즈의 모음이 dataframe 이다 
시리즈는 리스트로 변환할 수 있다.

행열순서는 변경이 가능한데, 열->행순은 값 변경이 안됨



mysql
1) 대상 컴퓨터의 ip

In [1]:
#01 패키지 참조
from pandas import read_excel, DataFrame

In [2]:
# 02 데이터 준비
df = read_excel('https://data.hossam.kr/grade.xlsx',index_col='이름')
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [3]:
# 데이터 구조 확인
# 데이터의 차원 확인
df.ndim

2

In [4]:
# 데이터 행,열 확인
df.shape

(5, 6)

In [5]:
# 각 변수의 데이터 타입 확인
df.dtypes
# object는 문자열

학년     int64
성별    object
국어     int64
영어     int64
수학     int64
과학     int64
dtype: object

02) 데이터 내용 확인

In [6]:
# 열조회
df['국어']

이름
철수    98
영희    88
민철    92
수현    63
호영    75
Name: 국어, dtype: int64

In [8]:
# 열에 대한 데이터타입 확인
type(df['국어'])

pandas.core.series.Series

In [7]:
# 행 조회
df.loc['철수']

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object

In [10]:
# 행에 대한 데이터타입 확인
type(df.loc['철수'])

pandas.core.series.Series

In [14]:
# 값 확인하기(열->행 순서)
df['국어'],['철수']

(이름
 철수    98
 영희    88
 민철    92
 수현    63
 호영    75
 Name: 국어, dtype: int64,
 ['철수'])

In [15]:
df.loc['철수','국어']

98

In [16]:
# 값의 변경
# 행->열 순으로 접근하는 경우만 가능함
df.loc['철수','국어'] = 100
df

    학년  성별   국어  영어  수학  과학
이름
철수   1  남자  100  77  88  64
영희   2  여자   88  90  62  72
민철   1  남자   92  70  83  79
수현   3  여자   63  60  31  70
호영   4  남자   75  50  90  88

In [17]:
# 상위 n건 확인
# 파라미터가 없을 때는 5개가 기본값
df.head(2)

    학년  성별   국어  영어  수학  과학
이름
철수   1  남자  100  77  88  64
영희   2  여자   88  90  62  72

In [18]:
# 하위 n건 확인
# 파라미터가 없을 때는 5개가 기본값
df.tail(2)

    학년  성별  국어  영어  수학  과학
이름
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [19]:
# 특정 열에 대한 데이터 빈도수 확인
df['성별'].value_counts()

성별
남자    3
여자    2
Name: count, dtype: int64